---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousrailProfileTypeParam
source: html/8d1202a5-941b-75ee-1d7f-eae6cc338196.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousrailProfileTypeParam Property

"Profile"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousrailProfileTypeParam { get; }
```